Revit 2027 API
FailureHandlingOptions.SetFailuresPreprocessor Method
 Sets the callback to be invoked in the beginning of failure processing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureHandlingOptions SetFailuresPreprocessor(
	IFailuresPreprocessor preprocessor
)
Public Function SetFailuresPreprocessor (
	preprocessor As IFailuresPreprocessor
) As FailureHandlingOptions
public:
FailureHandlingOptions^ SetFailuresPreprocessor(
	IFailuresPreprocessor^ preprocessor
)
member SetFailuresPreprocessor :
        preprocessor : IFailuresPreprocessor -> FailureHandlingOptions
Parameters
preprocessor IFailuresPreprocessor
 The callback to be invoked in the beginning of failure processing.
Return Value
FailureHandlingOptions
 This FailureHandlingOptions object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace